# Titanic - Feature Engineering Baseline

This time, we will only do basic stuff. We won't do anything fancy here, just remove `Name` and `Ticket` columns since they are not directly useful for modeling.
This will serve as a baseline for us to compare with more advanced feature engineering techniques later.

In [3]:
import os
import pandas as pd

# Load dataset
path_dir = os.path.join("..", "..", "data")
df = pd.read_csv(os.path.join(path_dir, "preprocessed", "preprocessed_train.csv"))
df_test = pd.read_csv(os.path.join(path_dir, "preprocessed", "preprocessed_test.csv"))

# Remove `Name` and `Ticket` features
df = df.drop(['Name', 'Ticket'], axis=1)
df_test = df_test.drop(['Name', 'Ticket'], axis=1)

# Save file
df.to_csv(os.path.join(path_dir, "feature_engineered", "baseline", "baseline_engineered_train.csv"), index=False)
df_test.to_csv(os.path.join(path_dir, "feature_engineered", "baseline", "baseline_engineered_test.csv"), index=False)

df.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0            1         0       3    1  22.0      1      0   7.2500         2
1            2         1       1    0  38.0      1      0  71.2833         0
2            3         1       3    0  26.0      0      0   7.9250         2
3            4         1       1    0  35.0      1      0  53.1000         2
4            5         0       3    1  35.0      0      0   8.0500         2

# The end